app/controllers/tweets_controller.rb

SELECT `tweets`.* FROM `tweets`
---
    def index
        @tweets = Tweet.all

INSERT INTO `tweets` (`body`, `created_at`, `updated_at`) VALUES ('こんにちは', '2020-12-15 07:30:17.140566', '2020-12-15 07:30:17.140566')
---
      def create
        tweet = Tweet.new(tweet_params)
        if tweet.save

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
---
      def show
        @tweet = Tweet.find(params[:id])

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'こんにちは！', `tweets`.`updated_at` = '2020-12-19 02:21:43.240955' WHERE `tweets`.`id` = 1
---
      def update
        tweet = Tweet.find(params[:id])
        if tweet.update(tweet_params)

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 1
---
      def destroy
        tweet = Tweet.find(params[:id])
        tweet.destroy